{
  "blogs": [
    {
      "title": "Closing Time",
      "body": "Fiona banks her ride in front of Mel’s Hot & Cold Heroes. Her Oldsmobile Cutlass is like a battered lemon shark. She leaves the motor running, reaches back to smooth the watch plaid blanket across the slippery backseat. The stand’s iron grating is drawn against the Cincinnati night. Her man is inside. Mel. Waltzing the mop around. Reeking of grease and onion. His upper arm is inked, Blue Valentine. He doesn’t like her to see him dirty. Normally showers and changes before their dates. Buffs his nails. Tonight, she’ll get him before the ablutions. Fiona grips the grating. Shakes it.",
      "author": "mario",
      "id": 1
    },
    {
      "title": "Ashes to Ashes, Dust to Dust, Clay to Kintsukuroi",
      "body": "My deep purple vase sat proudly on the dining room table of our tiny home.\n\nBlack sand from Te Henga was the temper I had worked into the clay.\n\nTemper helps clay to withstand thermal shock. Temper doesn’t help clay withstand the shock from a husband who, the more he drank, the more certain he became that I was sleeping with Jonathan. Temper doesn’t help clay withstand being thrown at the fireplace.\n\nKintsukuroi is the Japanese twist of repairing broken pottery with gold. My purple vase with its golden spider web now sits, slightly wobbly, on my new apartment’s mantle.",
      "author": "mario",
      "id": 2
    },
    {
      "title": "A Blanket Decision",
      "body": "At the Twisted Stitchers meeting, I held up my first, nearly finished, crocheted baby blanket. They oohed and ahhed. “But look,” I said, “There’s a mistake 40 rows back. Should I frog it?” The thought of ripping out thousands of stitches, weeks of work, irked me. They smiled, shrugged, and crocheted. Finally, someone said, “It’s about what you can live with.” I hesitated. I had three ex-husbands, too many former jobs and careers to count, a slew of lost friendships, and closets full of bad purchases. I picked up the yarn and pulled. Finally, a mistake I could completely undo.",
      "author": "yoshi",
      "id": 3
    },
    {
      "title": "Memento",
      "body": "The day Lucinda turned nine, her father appeared at the back door. She hadn’t seen him in two years. When she opened her mouth to speak, he put his finger to her lips. Where’s your mother? Upstairs. Come with me, he said. Let’s go to the fair. His car smelled like dirty clothes. They had one hour before the police arrived. As her mother ran toward her, black hair flying in the wind, mouth open, Lucinda turned. He was gone. She shoved the photo they had taken in the booth deep into her pocket just as her mother reached her.",
      "author": "yoshi",
      "id": 4
    }
  ]
}